ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l211x_l112x/TIMB3_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="TIMB3" HW_revision="1.0">
    <register id="TIMB3_FSUB_0" width="32" offset="0x400" description="Subscriber Configuration Register.">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 255."/>
        </bitfield>
    </register>
    <register id="TIMB3_FPUB_0" width="32" offset="0x444" description="Publisher Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <group id="TIMB3_GPRCM" name="TIMB3_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="TIMB3_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="TIMB3_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="TIMB3_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="TIMB3_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="IMMEDIATE" value="0x0" description="The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="TIMB3_CPU_INT" name="TIMB3_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="TIMB3_CPU_INT_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="9" end="0" width="10" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="CNT0OVF" value="0x1" description="Counter0 period match  interrupt"/>
                <bitenum id="CNT0STRT" value="0x2" description="Counter 0 start"/>
                <bitenum id="CNT0STOP" value="0x3" description="Counter0 stop"/>
                <bitenum id="CNT1OVF" value="0x4" description="Counter1 period match  interrupt"/>
                <bitenum id="CNT1STRT" value="0x5" description="Counter 1 start"/>
                <bitenum id="CNT1STOP" value="0x6" description="Counter1 stop"/>
                <bitenum id="CNT2OVF" value="0x7" description="Counter2 period match  interrupt"/>
                <bitenum id="CNT2STRT" value="0x8" description="Counter 2 start"/>
                <bitenum id="CNT2STOP" value="0x9" description="Counter2 stop"/>
                <bitenum id="CNT3OVF" value="0xA" description="Counter3 period match  interrupt"/>
                <bitenum id="CNT3STRT" value="0xB" description="Counter 3 start"/>
                <bitenum id="CNT3STOP" value="0xC" description="Counter3 stop"/>
                <bitenum id="CNT4OVF" value="0xD" description="Counter4 period match  interrupt"/>
                <bitenum id="CNT4STRT" value="0xE" description="Counter 4 start"/>
                <bitenum id="CNT4STOP" value="0xF" description="Counter4 stop"/>
                <bitenum id="CNT5OVF" value="0x10" description="Counter5 period match  interrupt"/>
                <bitenum id="CNT5STRT" value="0x11" description="Counter 5 start"/>
                <bitenum id="CNT5STOP" value="0x12" description="Counter5 stop"/>
                <bitenum id="CNT6OVF" value="0x13" description="Counter6 period match  interrupt"/>
                <bitenum id="CNT6STRT" value="0x14" description="Counter 6 start"/>
                <bitenum id="CNT6STOP" value="0x15" description="Counter6 stop"/>
                <bitenum id="CNT7OVF" value="0x16" description="Counter7 period match  interrupt"/>
                <bitenum id="CNT7STRT" value="0x17" description="Counter 7 start"/>
                <bitenum id="CNT7STOP" value="0x18" description="Counter7 stop"/>
            </bitfield>
        </register>
